{
  "format": "layers-model",
  "generatedBy": "keras v2.3.1",
  "convertedBy": "TensorFlow.js Converter v1.2.10.1",
  "modelTopology": {
    "keras_version": "2.3.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "batch_input_shape": [null, 82],
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 9,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "learning_rate": 0.009999999776482582,
          "momentum": 0.8999999761581421,
          "decay": 9.999999974752427e-7,
          "nesterov": true
        }
      },
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": ["tensorflow%2Fgroup1-shard1of1.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [82, 128], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [64, 9], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [9], "dtype": "float32" }
      ]
    }
  ]
}
